tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/services"
# -----------------
# brew
brew "bat"
brew "cmake"
brew "coreutils"
brew "csvkit"
brew "ctags"
brew "dive"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "gpg"
brew "grip"
brew "htop"
brew "httpie"
brew "jq"
brew "mtr"
brew "node"
brew "neovim"
brew "ripgrep"
brew "telnet"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "watch"
brew "rbenv"
brew "ruby-build"
brew "zsh"
# -----------------
# LSP
brew "pyright"
# -----------------
# Cask
cask "1password"
cask "anki"
cask "cleanshot"
cask "cron"
cask "docker"
cask "expressvpn"
cask "iterm2"
cask "obsidian"
cask "raycast"
cask "rectangle"
cask "spotify"
cask "sublime-text"
cask "utm"
cask "visual-studio-code"
cask "syncalicious"
